In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv("D:\ASSIGNMENTS\\3rd YEAR 2nd SEM\\DSBDA\\Partially Cleaned Salary Dataset.csv")

C:\Users\aryan\AppData\Local\Temp\ipykernel_12108\2980030240.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
df.replace("?",np.nan,inplace=True)
df.isnull().sum()

Unnamed: 0           0
Company Name         0
Job Title            0
Salaries Reported    0
Location             0
Salary               0
dtype: int64

In [4]:
df.groupby("Job Title")
df.head(10)

,Unnamed: 0,Company Name,Job Title,Salaries Reported,Location,Salary
0,0,Mu Sigma,Data Scientist,105,Bangalore,648573.0
1,1,IBM,Data Scientist,95,Bangalore,1191950.0
2,2,Tata Consultancy Services,Data Scientist,66,Bangalore,836874.0
3,3,Impact Analytics,Data Scientist,40,Bangalore,669578.0
4,4,Accenture,Data Scientist,32,Bangalore,944110.0
5,5,Infosys,Data Scientist,30,Bangalore,908764.0
6,6,Capgemini,Data Scientist,28,Bangalore,926124.0
7,7,Cognizant Technology Solutions,Data Scientist,26,Bangalore,736708.0
8,8,Anheuser-Busch InBev,Data Scientist,25,Bangalore,1646721.0
9,9,Fractal,Data Scientist,22,Bangalore,1392960.0

In [6]:
mean = df.groupby("Job Title")["Salary"].mean()
print(mean)

Job Title
Associate Machine Learning Engineer     4.643720e+05
Data Analyst                            6.164699e+05
Data Engineer                           1.309051e+06
Data Science                            3.649053e+05
Data Science Associate                  1.203913e+06
Data Science Consultant                 2.671464e+06
Data Science Lead                       4.068310e+06
Data Science Manager                    4.619021e+06
Data Scientist                          1.411330e+06
Data Scientist - Trainee                6.105120e+05
Junior Data Scientist                   5.963231e+05
Lead Data Scientist                     1.852189e+06
Machine Learning Associate              2.951140e+05
Machine Learning Consultant             7.064010e+05
Machine Learning Data Analyst           3.613780e+05
Machine Learning Data Associate         2.758410e+05
Machine Learning Data Associate I       2.585960e+05
Machine Learning Data Associate II      3.832130e+05
Machine Learning Developer              5.811190e+05
Machine Learning Engineer               7.971884e+05
Machine Learning Scientist              1.701180e+05
Machine Learning Software Engineer      1.397347e+06
Senior Data Scientist                   1.766130e+06
Senior Machine Learning Engineer        1.473436e+06
Software Engineer - Machine Learning    1.566780e+06
Name: Salary, dtype: float64

In [7]:
median = df.groupby("Job Title")["Salary"].median()
print(median)

Job Title
Associate Machine Learning Engineer      464372.0
Data Analyst                             508150.5
Data Engineer                            792683.0
Data Science                             240780.0
Data Science Associate                  1203913.0
Data Science Consultant                 2671464.0
Data Science Lead                       4068310.0
Data Science Manager                    4619021.0
Data Scientist                           914480.0
Data Scientist - Trainee                 610512.0
Junior Data Scientist                    554963.0
Lead Data Scientist                     1664364.0
Machine Learning Associate               295114.0
Machine Learning Consultant              706401.0
Machine Learning Data Analyst            361378.0
Machine Learning Data Associate          275841.0
Machine Learning Data Associate I        258596.0
Machine Learning Data Associate II       383213.0
Machine Learning Developer               581119.0
Machine Learning Engineer                627048.5
Machine Learning Scientist               170118.0
Machine Learning Software Engineer      1397347.0
Senior Data Scientist                   1733388.0
Senior Machine Learning Engineer        1335445.0
Software Engineer - Machine Learning    1566780.0
Name: Salary, dtype: float64

In [8]:
minimum = df.groupby("Job Title")["Salary"].min()
print(minimum)

Job Title
Associate Machine Learning Engineer      464372.0
Data Analyst                              10814.0
Data Engineer                             33120.0
Data Science                              60840.0
Data Science Associate                  1203913.0
Data Science Consultant                 2671464.0
Data Science Lead                       4068310.0
Data Science Manager                    4619021.0
Data Scientist                            48000.0
Data Scientist - Trainee                 610512.0
Junior Data Scientist                     60840.0
Lead Data Scientist                     1520967.0
Machine Learning Associate               295114.0
Machine Learning Consultant              186475.0
Machine Learning Data Analyst            361378.0
Machine Learning Data Associate          275841.0
Machine Learning Data Associate I        258596.0
Machine Learning Data Associate II       383213.0
Machine Learning Developer               410952.0
Machine Learning Engineer                 21628.0
Machine Learning Scientist                62160.0
Machine Learning Software Engineer      1397347.0
Senior Data Scientist                    324089.0
Senior Machine Learning Engineer         229416.0
Software Engineer - Machine Learning    1521236.0
Name: Salary, dtype: float64

In [9]:
maximum = df.groupby("Job Title")["Salary"].max()
print(maximum)

Job Title
Associate Machine Learning Engineer     4.643720e+05
Data Analyst                            3.900962e+07
Data Engineer                           1.190400e+08
Data Science                            2.000000e+06
Data Science Associate                  1.203913e+06
Data Science Consultant                 2.671464e+06
Data Science Lead                       4.068310e+06
Data Science Manager                    4.619021e+06
Data Scientist                          1.661404e+08
Data Scientist - Trainee                6.105120e+05
Junior Data Scientist                   1.498750e+06
Lead Data Scientist                     2.839138e+06
Machine Learning Associate              2.951140e+05
Machine Learning Consultant             1.226327e+06
Machine Learning Data Analyst           3.613780e+05
Machine Learning Data Associate         2.758410e+05
Machine Learning Data Associate I       2.585960e+05
Machine Learning Data Associate II      3.832130e+05
Machine Learning Developer              7.512860e+05
Machine Learning Engineer               6.518917e+06
Machine Learning Scientist              2.780760e+05
Machine Learning Software Engineer      1.397347e+06
Senior Data Scientist                   3.654010e+06
Senior Machine Learning Engineer        3.110514e+06
Software Engineer - Machine Learning    1.612324e+06
Name: Salary, dtype: float64

In [10]:
std = df.groupby("Job Title")["Salary"].std()
print(std)

Job Title
Associate Machine Learning Engineer              NaN
Data Analyst                            1.292116e+06
Data Engineer                           6.009190e+06
Data Science                            3.388020e+05
Data Science Associate                           NaN
Data Science Consultant                          NaN
Data Science Lead                                NaN
Data Science Manager                             NaN
Data Scientist                          5.140558e+06
Data Scientist - Trainee                         NaN
Junior Data Scientist                   3.931792e+05
Lead Data Scientist                     5.017356e+05
Machine Learning Associate                       NaN
Machine Learning Consultant             7.352864e+05
Machine Learning Data Analyst                    NaN
Machine Learning Data Associate                  NaN
Machine Learning Data Associate I                NaN
Machine Learning Data Associate II               NaN
Machine Learning Developer              2.406525e+05
Machine Learning Engineer               7.047460e+05
Machine Learning Scientist              1.526757e+05
Machine Learning Software Engineer               NaN
Senior Data Scientist                   7.833905e+05
Senior Machine Learning Engineer        9.506370e+05
Software Engineer - Machine Learning    6.440894e+04
Name: Salary, dtype: float64